## Terraform checks in directory ''
#### Terraform Format and Style 🖌`main.tf
terraform.tfvars
variables.tf
`
#### Terraform Initialization ⚙️`[0m[1mInitializing modules...[0m
- gke in ../../modules/compute/gke
- network in ../../modules/network

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/google...
- Installing hashicorp/google v5.32.0...
- Installed hashicorp/google v5.32.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
`
#### Terraform Plan 📖`
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.gke.google_container_cluster.primary[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_cluster" "primary" {
      [32m+[0m [0m[1m[0mcluster_ipv4_cidr[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mdatapath_provider[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mdefault_max_pods_per_node[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m                      = false
      [32m+[0m [0m[1m[0menable_cilium_clusterwide_network_policy[0m[0m = false
      [32m+[0m [0m[1m[0menable_intranode_visibility[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0menable_kubernetes_alpha[0m[0m                  = false
      [32m+[0m [0m[1m[0menable_l4_ilb_subsetting[0m[0m                 = false
      [32m+[0m [0m[1m[0menable_legacy_abac[0m[0m                       = false
      [32m+[0m [0m[1m[0menable_shielded_nodes[0m[0m                    = true
      [32m+[0m [0m[1m[0mendpoint[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m                       = 1
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                                 = "asia-northeast3"
      [32m+[0m [0m[1m[0mlogging_service[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mmaster_version[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_service[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                     = "dev-cluster"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mnetworking_mode[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mnode_locations[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mnode_version[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                                  = "portfogram-gke"
      [32m+[0m [0m[1m[0mremove_default_node_pool[0m[0m                 = true
      [32m+[0m [0m[1m[0mself_link[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mservices_ipv4_cidr[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0msubnetwork[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mtpu_ipv4_cidr_block[0m[0m                      = (known after apply)

      [32m+[0m [0maddons_config {
          [32m+[0m [0mcloudrun_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mload_balancer_type[0m[0m = (known after apply)
            }

          [32m+[0m [0mconfig_connector_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mdns_cache_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgce_persistent_disk_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgcp_filestore_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgcs_fuse_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgke_backup_agent_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhorizontal_pod_autoscaling {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhttp_load_balancing {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mnetwork_policy_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mstateful_ha_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mauthenticator_groups_config {
          [32m+[0m [0m[1m[0msecurity_group[0m[0m = (known after apply)
        }

      [32m+[0m [0mcluster_autoscaling {
          [32m+[0m [0m[1m[0mautoscaling_profile[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m             = (known after apply)

          [32m+[0m [0mauto_provisioning_defaults {
              [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mdisk_size[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)

              [32m+[0m [0mmanagement {
                  [32m+[0m [0m[1m[0mauto_repair[0m[0m     = (known after apply)
                  [32m+[0m [0m[1m[0mauto_upgrade[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mupgrade_options[0m[0m = (known after apply)
                }

              [32m+[0m [0mshielded_instance_config {
                  [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
                }

              [32m+[0m [0mupgrade_settings {
                  [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
                  [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

                  [32m+[0m [0mblue_green_settings {
                      [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

                      [32m+[0m [0mstandard_rollout_policy {
                          [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                        }
                    }
                }
            }

          [32m+[0m [0mresource_limits {
              [32m+[0m [0m[1m[0mmaximum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mminimum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mresource_type[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_nodes {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mcost_management_config {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mdatabase_encryption {
          [32m+[0m [0m[1m[0mkey_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstate[0m[0m    = (known after apply)
        }

      [32m+[0m [0mdefault_snat_status {
          [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mgateway_api_config {
          [32m+[0m [0m[1m[0mchannel[0m[0m = (known after apply)
        }

      [32m+[0m [0midentity_service_config {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mip_allocation_policy {
          [32m+[0m [0m[1m[0mcluster_ipv4_cidr_block[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mcluster_secondary_range_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mservices_ipv4_cidr_block[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mservices_secondary_range_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                    = "IPV4"

          [32m+[0m [0mpod_cidr_overprovision_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mlogging_config {
          [32m+[0m [0m[1m[0menable_components[0m[0m = (known after apply)
        }

      [32m+[0m [0mmaster_auth {
          [32m+[0m [0m[1m[0mclient_certificate[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mclient_key[0m[0m             = (sensitive value)
          [32m+[0m [0m[1m[0mcluster_ca_certificate[0m[0m = (known after apply)

          [32m+[0m [0mclient_certificate_config {
              [32m+[0m [0m[1m[0missue_client_certificate[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mmaster_authorized_networks_config {
          [32m+[0m [0m[1m[0mgcp_public_cidrs_access_enabled[0m[0m = (known after apply)

          [32m+[0m [0mcidr_blocks {
              [32m+[0m [0m[1m[0mcidr_block[0m[0m = "0.0.0.0/0"
            }
        }

      [32m+[0m [0mmesh_certificates {
          [32m+[0m [0m[1m[0menable_certificates[0m[0m = (known after apply)
        }

      [32m+[0m [0mmonitoring_config {
          [32m+[0m [0m[1m[0menable_components[0m[0m = (known after apply)

          [32m+[0m [0madvanced_datapath_observability_config {
              [32m+[0m [0m[1m[0menable_metrics[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_relay[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mrelay_mode[0m[0m     = (known after apply)
            }

          [32m+[0m [0mmanaged_prometheus {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0meffective_taints[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_storage[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mlogging_variant[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mmetadata[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mnode_group[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mresource_labels[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mresource_manager_tags[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mservice_account[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mspot[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                        = (known after apply)

          [32m+[0m [0madvanced_machine_features {
              [32m+[0m [0m[1m[0menable_nested_virtualization[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mthreads_per_core[0m[0m             = (known after apply)
            }

          [32m+[0m [0mconfidential_nodes {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mcontainerd_config {
              [32m+[0m [0mprivate_registry_access_config {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

                  [32m+[0m [0mcertificate_authority_domain_config {
                      [32m+[0m [0m[1m[0mfqdns[0m[0m = (known after apply)

                      [32m+[0m [0mgcp_secret_manager_certificate_config {
                          [32m+[0m [0m[1m[0msecret_uri[0m[0m = (known after apply)
                        }
                    }
                }
            }

          [32m+[0m [0mephemeral_storage_local_ssd_config {
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mfast_socket {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgcfs_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgvnic {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhost_maintenance_policy {
              [32m+[0m [0m[1m[0mmaintenance_interval[0m[0m = (known after apply)
            }

          [32m+[0m [0mkubelet_config {
              [32m+[0m [0m[1m[0mcpu_cfs_quota[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mcpu_cfs_quota_period[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mcpu_manager_policy[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mpod_pids_limit[0m[0m       = (known after apply)
            }

          [32m+[0m [0mlinux_node_config {
              [32m+[0m [0m[1m[0mcgroup_mode[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msysctls[0m[0m     = (known after apply)
            }

          [32m+[0m [0mlocal_nvme_ssd_block_config {
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mreservation_affinity {
              [32m+[0m [0m[1m[0mconsume_reservation_type[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mkey[0m[0m                      = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m                   = (known after apply)
            }

          [32m+[0m [0msecondary_boot_disks {
              [32m+[0m [0m[1m[0mdisk_image[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmode[0m[0m       = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0msole_tenant_config {
              [32m+[0m [0mnode_affinity {
                  [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
                  [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
                }
            }

          [32m+[0m [0mtaint {
              [32m+[0m [0m[1m[0meffect[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalue[0m[0m  = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_pool {
          [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mnode_count[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mversion[0m[0m                     = (known after apply)

          [32m+[0m [0mautoscaling {
              [32m+[0m [0m[1m[0mlocation_policy[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mmax_node_count[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mmin_node_count[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mtotal_max_node_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtotal_min_node_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mmanagement {
              [32m+[0m [0m[1m[0mauto_repair[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = (known after apply)
            }

          [32m+[0m [0mnetwork_config {
              [32m+[0m [0m[1m[0mcreate_pod_range[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0menable_private_nodes[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mpod_ipv4_cidr_block[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mpod_range[0m[0m            = (known after apply)

              [32m+[0m [0mnetwork_performance_config {
                  [32m+[0m [0m[1m[0mtotal_egress_bandwidth_tier[0m[0m = (known after apply)
                }

              [32m+[0m [0mpod_cidr_overprovision_config {
                  [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mnode_config {
              [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mdisk_type[0m[0m                   = (known after apply)
              [32m+[0m [0m[1m[0meffective_taints[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0menable_confidential_storage[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mguest_accelerator[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage_type[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mlabels[0m[0m                      = (known after apply)
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mlogging_variant[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mmachine_type[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mmetadata[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mnode_group[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mresource_labels[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mresource_manager_tags[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mspot[0m[0m                        = (known after apply)
              [32m+[0m [0m[1m[0mtags[0m[0m                        = (known after apply)

              [32m+[0m [0madvanced_machine_features {
                  [32m+[0m [0m[1m[0menable_nested_virtualization[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mthreads_per_core[0m[0m             = (known after apply)
                }

              [32m+[0m [0mconfidential_nodes {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mcontainerd_config {
                  [32m+[0m [0mprivate_registry_access_config {
                      [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

                      [32m+[0m [0mcertificate_authority_domain_config {
                          [32m+[0m [0m[1m[0mfqdns[0m[0m = (known after apply)

                          [32m+[0m [0mgcp_secret_manager_certificate_config {
                              [32m+[0m [0m[1m[0msecret_uri[0m[0m = (known after apply)
                            }
                        }
                    }
                }

              [32m+[0m [0mephemeral_storage_local_ssd_config {
                  [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
                }

              [32m+[0m [0mfast_socket {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mgcfs_config {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mgvnic {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mhost_maintenance_policy {
                  [32m+[0m [0m[1m[0mmaintenance_interval[0m[0m = (known after apply)
                }

              [32m+[0m [0mkubelet_config {
                  [32m+[0m [0m[1m[0mcpu_cfs_quota[0m[0m        = (known after apply)
                  [32m+[0m [0m[1m[0mcpu_cfs_quota_period[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mcpu_manager_policy[0m[0m   = (known after apply)
                  [32m+[0m [0m[1m[0mpod_pids_limit[0m[0m       = (known after apply)
                }

              [32m+[0m [0mlinux_node_config {
                  [32m+[0m [0m[1m[0mcgroup_mode[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msysctls[0m[0m     = (known after apply)
                }

              [32m+[0m [0mlocal_nvme_ssd_block_config {
                  [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
                }

              [32m+[0m [0mreservation_affinity {
                  [32m+[0m [0m[1m[0mconsume_reservation_type[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mkey[0m[0m                      = (known after apply)
                  [32m+[0m [0m[1m[0mvalues[0m[0m                   = (known after apply)
                }

              [32m+[0m [0msecondary_boot_disks {
                  [32m+[0m [0m[1m[0mdisk_image[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mmode[0m[0m       = (known after apply)
                }

              [32m+[0m [0mshielded_instance_config {
                  [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
                }

              [32m+[0m [0msole_tenant_config {
                  [32m+[0m [0mnode_affinity {
                      [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
                      [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
                    }
                }

              [32m+[0m [0mtaint {
                  [32m+[0m [0m[1m[0meffect[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mvalue[0m[0m  = (known after apply)
                }

              [32m+[0m [0mworkload_metadata_config {
                  [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mplacement_policy {
              [32m+[0m [0m[1m[0mpolicy_name[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mtpu_topology[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
            }

          [32m+[0m [0mqueued_provisioning {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mupgrade_settings {
              [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

              [32m+[0m [0mblue_green_settings {
                  [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

                  [32m+[0m [0mstandard_rollout_policy {
                      [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                      [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                      [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                    }
                }
            }
        }

      [32m+[0m [0mnode_pool_auto_config {
          [32m+[0m [0m[1m[0mresource_manager_tags[0m[0m = (known after apply)

          [32m+[0m [0mnetwork_tags {
              [32m+[0m [0m[1m[0mtags[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_pool_defaults {
          [32m+[0m [0mnode_config_defaults {
              [32m+[0m [0m[1m[0mlogging_variant[0m[0m = (known after apply)

              [32m+[0m [0mcontainerd_config {
                  [32m+[0m [0mprivate_registry_access_config {
                      [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

                      [32m+[0m [0mcertificate_authority_domain_config {
                          [32m+[0m [0m[1m[0mfqdns[0m[0m = (known after apply)

                          [32m+[0m [0mgcp_secret_manager_certificate_config {
                              [32m+[0m [0m[1m[0msecret_uri[0m[0m = (known after apply)
                            }
                        }
                    }
                }
            }
        }

      [32m+[0m [0mnotification_config {
          [32m+[0m [0mpubsub {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtopic[0m[0m   = (known after apply)

              [32m+[0m [0mfilter {
                  [32m+[0m [0m[1m[0mevent_type[0m[0m = (known after apply)
                }
            }
        }

      [32m+[0m [0mrelease_channel {
          [32m+[0m [0m[1m[0mchannel[0m[0m = (known after apply)
        }

      [32m+[0m [0msecurity_posture_config {
          [32m+[0m [0m[1m[0mmode[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mvulnerability_mode[0m[0m = (known after apply)
        }

      [32m+[0m [0mservice_external_ips_config {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mvertical_pod_autoscaling {
          [32m+[0m [0m[1m[0menabled[0m[0m = false
        }

      [32m+[0m [0mworkload_identity_config {
          [32m+[0m [0m[1m[0mworkload_pool[0m[0m = (known after apply)
        }
    }

[1m  # module.gke.google_container_node_pool.private_node_pool_1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_node_pool" "private_node_pool_1" {
      [32m+[0m [0m[1m[0mcluster[0m[0m                     = "dev-cluster"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "asia-northeast3"
      [32m+[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "private-node-pool-1"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mnode_count[0m[0m                  = 1
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = [
          [32m+[0m [0m"asia-northeast3-a",
        ]
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "portfogram-gke"
      [32m+[0m [0m[1m[0mversion[0m[0m                     = (known after apply)

      [32m+[0m [0mmanagement {
          [32m+[0m [0m[1m[0mauto_repair[0m[0m  = false
          [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = true
        }

      [32m+[0m [0mnetwork_config {
          [32m+[0m [0m[1m[0mcreate_pod_range[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0menable_private_nodes[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpod_ipv4_cidr_block[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpod_range[0m[0m            = (known after apply)

          [32m+[0m [0mnetwork_performance_config {
              [32m+[0m [0m[1m[0mtotal_egress_bandwidth_tier[0m[0m = (known after apply)
            }

          [32m+[0m [0mpod_cidr_overprovision_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0meffective_taints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = "UBUNTU_CONTAINERD"
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mlogging_variant[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = "e2-medium"
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = false
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mspot[0m[0m              = false

          [32m+[0m [0mconfidential_nodes {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mupgrade_settings {
          [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

          [32m+[0m [0mblue_green_settings {
              [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

              [32m+[0m [0mstandard_rollout_policy {
                  [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                }
            }
        }
    }

[1m  # module.gke.google_container_node_pool.private_node_pool_2[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_node_pool" "private_node_pool_2" {
      [32m+[0m [0m[1m[0mcluster[0m[0m                     = "dev-cluster"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "asia-northeast3"
      [32m+[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "private-node-pool-2"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mnode_count[0m[0m                  = 1
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = [
          [32m+[0m [0m"asia-northeast3-b",
        ]
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "portfogram-gke"
      [32m+[0m [0m[1m[0mversion[0m[0m                     = (known after apply)

      [32m+[0m [0mmanagement {
          [32m+[0m [0m[1m[0mauto_repair[0m[0m  = false
          [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = true
        }

      [32m+[0m [0mnetwork_config {
          [32m+[0m [0m[1m[0mcreate_pod_range[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0menable_private_nodes[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpod_ipv4_cidr_block[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpod_range[0m[0m            = (known after apply)

          [32m+[0m [0mnetwork_performance_config {
              [32m+[0m [0m[1m[0mtotal_egress_bandwidth_tier[0m[0m = (known after apply)
            }

          [32m+[0m [0mpod_cidr_overprovision_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0meffective_taints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = "UBUNTU_CONTAINERD"
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mlogging_variant[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = "e2-medium"
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = false
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mspot[0m[0m              = false

          [32m+[0m [0mconfidential_nodes {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mupgrade_settings {
          [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

          [32m+[0m [0mblue_green_settings {
              [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

              [32m+[0m [0mstandard_rollout_policy {
                  [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                }
            }
        }
    }

[1m  # module.gke.google_container_node_pool.public_node_pool[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_node_pool" "public_node_pool" {
      [32m+[0m [0m[1m[0mcluster[0m[0m                     = "dev-cluster"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "asia-northeast3"
      [32m+[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "public-node-pool"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mnode_count[0m[0m                  = 1
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = [
          [32m+[0m [0m"asia-northeast3-a",
        ]
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "portfogram-gke"
      [32m+[0m [0m[1m[0mversion[0m[0m                     = (known after apply)

      [32m+[0m [0mmanagement {
          [32m+[0m [0m[1m[0mauto_repair[0m[0m  = false
          [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = true
        }

      [32m+[0m [0mnetwork_config {
          [32m+[0m [0m[1m[0mcreate_pod_range[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0menable_private_nodes[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpod_ipv4_cidr_block[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpod_range[0m[0m            = (known after apply)

          [32m+[0m [0mnetwork_performance_config {
              [32m+[0m [0m[1m[0mtotal_egress_bandwidth_tier[0m[0m = (known after apply)
            }

          [32m+[0m [0mpod_cidr_overprovision_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0meffective_taints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = "UBUNTU_CONTAINERD"
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mlogging_variant[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = "e2-medium"
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = false
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mspot[0m[0m              = false

          [32m+[0m [0mconfidential_nodes {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mupgrade_settings {
          [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

          [32m+[0m [0mblue_green_settings {
              [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

              [32m+[0m [0mstandard_rollout_policy {
                  [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                }
            }
        }
    }

[1m  # module.network.google_compute_firewall.allow_external[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allow_external" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "dev-portfogram-allow-external"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "portfogram-gke"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"22",
              [32m+[0m [0m"80",
              [32m+[0m [0m"443",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # module.network.google_compute_firewall.allow_internal[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allow_internal" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "dev-portfogram-allow-internal"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "portfogram-gke"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"10.0.0.0/8",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"0-65535",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"0-65535",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "udp"
        }
      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = []
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "icmp"
        }
    }

[1m  # module.network.google_compute_network.vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "vpc" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m                   = false
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m           = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                        = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_range[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                      = "dev-portfogram-vpc"
      [32m+[0m [0m[1m[0mnetwork_firewall_policy_enforcement_order[0m[0m = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m [0m[1m[0mnumeric_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                                   = "portfogram-gke"
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                                 = (known after apply)
    }

[1m  # module.network.google_compute_router.nat_router[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router" "nat_router" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "dev-portfogram-nat-router"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "portfogram-gke"
      [32m+[0m [0m[1m[0mregion[0m[0m             = "asia-northeast3"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # module.network.google_compute_router_nat.nat_gw[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router_nat" "nat_gw" {
      [32m+[0m [0m[1m[0mauto_network_tier[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_dynamic_port_allocation[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0menable_endpoint_independent_mapping[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mendpoint_types[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0micmp_idle_timeout_sec[0m[0m               = 30
      [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mmin_ports_per_vm[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                = "dev-portfogram-nat-gw"
      [32m+[0m [0m[1m[0mnat_ip_allocate_option[0m[0m              = "AUTO_ONLY"
      [32m+[0m [0m[1m[0mproject[0m[0m                             = "portfogram-gke"
      [32m+[0m [0m[1m[0mregion[0m[0m                              = "asia-northeast3"
      [32m+[0m [0m[1m[0mrouter[0m[0m                              = "dev-portfogram-nat-router"
      [32m+[0m [0m[1m[0msource_subnetwork_ip_ranges_to_nat[0m[0m  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      [32m+[0m [0m[1m[0mtcp_established_idle_timeout_sec[0m[0m    = 1200
      [32m+[0m [0m[1m[0mtcp_time_wait_timeout_sec[0m[0m           = 120
      [32m+[0m [0m[1m[0mtcp_transitory_idle_timeout_sec[0m[0m     = 30
      [32m+[0m [0m[1m[0mudp_idle_timeout_sec[0m[0m                = 30
    }

[1m  # module.network.google_compute_subnetwork.private_subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "private_subnet" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "10.0.0.0/24"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "dev-portfogram-private-subnet"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_google_access[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "portfogram-gke"
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "asia-northeast3"
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
    }

[1m  # module.network.google_compute_subnetwork.public_subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "public_subnet" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "192.0.0.0/24"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "dev-portfogram-public-subnet"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_google_access[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "portfogram-gke"
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "asia-northeast3"
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
    }

[0m[1mPlan:[0m 11 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
`